sim/task_2D_Cylinder_Template_fine/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "1500";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
20428
(
1.04417e-09
1.04433e-09
1.04449e-09
1.04464e-09
1.04479e-09
1.04494e-09
1.04508e-09
1.0452e-09
...
)
;

boundaryField
{
    sides
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 1.0441e-09;
    }
    topBot
    {
        type            calculated;
        value           nonuniform List<scalar> 
230
(
1.04411e-09
1.04414e-09
1.04417e-09
1.04421e-09
1.04424e-09
1.04427e-09
1.04429e-09
1.04431e-09
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
111
(
1.49844e-09
1.26305e-09
1.17065e-09
1.15072e-09
1.14391e-09
1.13437e-09
1.12401e-09
1.11396e-09
...
)
;
    }
    wall
    {
        type            nutUSpaldingWallFunction;
        value           nonuniform List<scalar> 
316
(
0.00024309
0.000239019
0.000234809
0.000230459
0.000225972
0.000221346
0.000216584
0.000211689
...
)
;
    }
}


// ************************************************************************* //
