sim/task_2D_Cylinder_Template_fine/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceScalarField;
    location    "1500";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<scalar> 
40472
(
4.68674
-0.000319892
0.00107611
4.68455
-0.000949514
0.00314529
4.68088
-0.00102726
...
)
;

boundaryField
{
    sides
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
111
(
-4.6875
-4.6875
-4.6875
-4.6875
-4.6875
-4.6875
-4.6875
-4.6875
...
)
;
    }
    topBot
    {
        type            calculated;
        value           nonuniform List<scalar> 
230
(
-5.67416e-05
0.000207845
0.000570643
0.00102326
0.0015564
0.00217107
0.00286116
0.00362505
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
111
(
5.08487
5.01561
4.98476
4.96177
4.94039
4.92038
4.90286
4.88727
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
