sim/task_2D_Cylinder_Template_fine/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    sides
    {
        type            empty;
        physicalType    empty;
        nFaces          40856;
        startFace       40472;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          111;
        startFace       81328;
    }
    topBot
    {
        type            patch;
        physicalType    patch;
        nFaces          230;
        startFace       81439;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          111;
        startFace       81669;
    }
    wall
    {
        type            wall;
        physicalType    wall;
        nFaces          316;
        startFace       81780;
    }
)

// ************************************************************************* //
